<?php

namespace Database\Seeders;

use App\Models\City;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class UpdateCitySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $arabic_names = [
            1 => 'أدرار',
            2 => 'الشلف',
            3 => 'الأغواط',
            4 => 'ورقلة',
            5 => 'باتنة',
            6 => 'بجاية',
            7 => 'بسكرة',
            8 => 'بشار',
            9 => 'البليدة',
            10 => 'البويرة',
            11 => 'تمنراست',
            12 => 'تبسة',
            13 => 'تلمسان',
            14 => 'تيارت',
            15 => 'تيزي وزو',
            16 => 'الجزائر',
            17 => 'الجلفة',
            18 => 'جيجل',
            19 => 'سطيف',
            20 => 'سعيدة',
            21 => 'سكيكدة',
            22 => 'سيدي بلعباس',
            23 => 'عنابة',
            24 => 'قالمة',
            25 => 'قسنطينة',
            26 => 'المدية',
            27 => 'مستغانم',
            28 => 'المسيلة',
            29 => 'معسكر',
            30 => 'ورقلة',
            31 => 'وهران',
            32 => 'البيض',
            33 => 'اليزي',
            34 => 'برج بوعريريج',
            35 => 'بومرداس',
            36 => 'الطارف',
            37 => 'تندوف',
            38 => 'تيسمسيلت',
            39 => 'الوادي',
            40 => 'خنشلة',
            41 => 'سوق أهراس',
            42 => 'تيبازة',
            43 => 'ميلة',
            44 => 'عين الدفلة',
            45 => 'النعامة',
            46 => 'عين تموشنت',
            47 => 'غرداية',
            48 => 'غليزان',
            49 => 'تبسة',
            50 => 'عين السمارة',
            51 => 'المغير',
            52 => 'أولاد جلال',
            53 => 'حاسي مسعود',
            54 => 'تبسبست',
            55 => 'مغرين',
            56 => 'حاسي الرمل',
            57 => 'وادي اليرى',
            58 => 'عين أمقل',
        ];

        foreach ($arabic_names as $code => $name) {
            $city = City::where('code', $code)->first();
            $city->update(['name_ar'=> $name]);
        }
    }
}
